// Створіть HTML-сторінку з декількома кнопками. 
//Ваше завдання - створити обробник подій для батьківського елементу, який відслідковуватиме кліки на всіх кнопках.

// 1. Створіть HTML-елементи: батьківський контейнер з декількома вкладеними кнопками.
// 2. Додайте обробник подій до батьківського контейнера, який відслідковуватиме кліки.
// 3. Після кліку на будь-якій кнопці, виведіть повідомлення про те, яка саме кнопка була клікнута.


document.querySelector('#buttons').addEventListener('click', function(event){
    if(event.target.tagName === 'INPUT' && event.target.getAttribute('data-action') === 'button' ){
        alert(`Клікнуто на кнопці: ${event.target.value}`);
    }
})